{
  "id": "53b00aaa8c41ed91",
  "title": "Google API Keys Weren't Secrets. But then Gemini Changed the Rules.",
  "url": "https://simonwillison.net/2026/Feb/26/google-api-keys/#atom-everything",
  "content": "<p><strong><a href=\"https://trufflesecurity.com/blog/google-api-keys-werent-secrets-but-then-gemini-changed-the-rules\">Google API Keys Weren&#x27;t Secrets. But then Gemini Changed the Rules.</a></strong></p>\nYikes! It turns out Gemini and Google Maps (and other services) share the same API keys... but Google Maps API keys are designed to be public, since they are embedded directly in web pages. Gemini API keys can be used to access private files and make billable API requests, so they absolutely should not be shared.</p>\n<p>If you don't understand this it's very easy to accidentally enable Gemini billing on a previously public API key that exists in the wild already.</p>\n<blockquote>\n<p>What makes this a privilege escalation rather than a misconfiguration is the sequence of events. </p>\n<ol>\n<li>A developer creates an API key and embeds it in a website for Maps. (At that point, the key is harmless.) </li>\n<li>The Gemini API gets enabled on the same project. (Now that same key can access sensitive Gemini endpoints.) </li>\n<li>The developer is never warned that the keys' privileges changed underneath it. (The key went from public identifier to secret credential).</li>\n</ol>\n</blockquote>\n<p>Truffle Security found 2,863 API keys in the November 2025 Common Crawl that could access Gemini, verified by hitting the <code>/models</code> listing endpoint. This included several keys belonging to Google themselves, one of which had been deployed since February 2023 (according to the Internet Archive) hence predating the Gemini API that it could now access.</p>\n<p>Google are working to revoke affected keys but it's still a good idea to check that none of yours are affected by this.\n\n    <p><small></small>Via <a href=\"https://news.ycombinator.com/item?id=47156925\">Hacker News</a></small></p>\n\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/api-keys\">api-keys</a>, <a href=\"https://simonwillison.net/tags/google\">google</a>, <a href=\"https://simonwillison.net/tags/security\">security</a>, <a href=\"https://simonwillison.net/tags/gemini\">gemini</a></p>"
}