{
  "id": "66a92bc60e283915",
  "title": "A Few Rambling Observations on Care",
  "url": "https://blog.jim-nielsen.com/2026/observations-on-care/",
  "content": "<p>In this new AI world, “taste” is the thing everyone claims is the new supreme skill.</p>\n<p>But I think “care” is the one I want to see in the products I buy.</p>\n<hr />\n<p>Can you measure care?</p>\n<p>Does scale drive out care?</p>\n<p>If a product conversation is reduced to being arbitrated exclusively by numbers, is care lost?</p>\n<p>The more I think about it, care seems antithetical to <a href=\"https://blog.jim-nielsen.com/2025/measurement-and-numbers/\">the reductive nature of quantification</a> — “one death is a tragedy, one million is a statistic”.</p>\n<hr />\n<p>Care considers useful, constructive systematic forces — rules, processes, etc. — but does not take them as law. Individual context and sensitivity are the primary considerations.</p>\n<p>That’s why the professional answer to so many questions is: “it depends”.</p>\n<p>“This is the law for everyone, everywhere, always” is not a system I want to live in.</p>\n<hr />\n<p>Businesses exist to make money, so one would assume a business will always act in a way that maximizes the amount of money that can be made.</p>\n<p>That’s where numbers take you. They let you measure who is gaining or losing the most quantifiable amount in any given transaction.</p>\n<p>But there’s <a href=\"https://notes.jim-nielsen.com/#2026-02-17T1712\">an unmeasurable, unquantifiable principle</a> lurking behind all those numbers: it can be good for business to leave money on the table.</p>\n<p>Why? Because you care. You are willing to provision room for something beyond just a quantity, a number, a dollar amount. </p>\n<hr />\n<p>I don’t think numbers alone can bring you to <em>care</em>. </p>\n<p>I mean, how silly is it to say:</p>\n<p>“How much care did you put into the product this week?” </p>\n<p>“Put me down for a 8 out of 10 this week.”</p>\n\n    <hr />\n    \n\n    <p>\n      Reply via:\n      \n\n      <a href=\"mailto:jimniels%2Bblog@gmail.com?subject=Re:%20blog.jim-nielsen.com/2026/observations-on-care/\">Email</a>\n      · <a href=\"https://mastodon.social/@jimniels\">Mastodon</a> ·\n\n      <a href=\"https://bsky.app/profile/jim-nielsen.com\">Bluesky</a>\n    </p>"
}