{
  "id": "731cd9de9269c929",
  "title": "ggml.ai joins Hugging Face to ensure the long-term progress of Local AI",
  "url": "https://simonwillison.net/2026/Feb/20/ggmlai-joins-hugging-face/#atom-everything",
  "content": "<p><strong><a href=\"https://github.com/ggml-org/llama.cpp/discussions/19759\">ggml.ai joins Hugging Face to ensure the long-term progress of Local AI</a></strong></p>\nI don't normally cover acquisition news like this, but I have some thoughts.</p>\n<p>It's hard to overstate the impact Georgi Gerganov has had on the local model space. Back in March 2023 his release of <a href=\"https://github.com/ggml-org/llama.cpp\">llama.cpp</a> made it possible to run a local LLM on consumer hardware. The <a href=\"https://github.com/ggml-org/llama.cpp/blob/775328064e69db1ebd7e19ccb59d2a7fa6142470/README.md?plain=1#L7\">original README</a> said:</p>\n<blockquote>\n<p>The main goal is to run the model using 4-bit quantization on a MacBook. [...] This was hacked in an evening - I have no idea if it works correctly.</p>\n</blockquote>\n<p>I wrote about trying llama.cpp out at the time in <a href=\"https://simonwillison.net/2023/Mar/11/llama/#llama-cpp\">Large language models are having their Stable Diffusion moment</a>:</p>\n<blockquote>\n<p>I used it to run the 7B LLaMA model on my laptop last night, and then this morning upgraded to the 13B model—the one that Facebook claim is competitive with GPT-3.</p>\n</blockquote>\n<p>Meta's <a href=\"https://github.com/meta-llama/llama/tree/llama_v1\">original LLaMA release</a> depended on PyTorch and their <a href=\"https://github.com/facebookresearch/fairscale\">FairScale</a> PyTorch extension for running on multiple GPUs, and required CUDA and NVIDIA hardware. Georgi's work opened that up to a much wider range of hardware and kicked off the local model movement that has continued to grow since then.</p>\n<p>Hugging Face are already responsible for the incredibly influential <a href=\"https://github.com/huggingface/transformers\">Transformers</a> library used by the majority of LLM releases today. They've proven themselves a good steward for that open source project, which makes me optimistic for the future of llama.cpp and related projects.</p>\n<p>This section from the announcement looks particularly promising:</p>\n<blockquote>\n<p>Going forward, our joint efforts will be geared towards the following objectives:</p>\n<ul>\n<li>Towards seamless \"single-click\" integration with the <a href=\"https://github.com/huggingface/transformers\">transformers</a> library. The <code>transformers</code> framework has established itself as the 'source of truth' for AI model definitions. Improving the compatibility between the transformers and the ggml ecosystems is essential for wider model support and quality control.</li>\n<li>Better packaging and user experience of ggml-based software. As we enter the phase in which local inference becomes a meaningful and competitive alternative to cloud inference, it is crucial to improve and simplify the way in which casual users deploy and access local models. We will work towards making llama.cpp ubiquitous and readily available everywhere, and continue partnering with great downstream projects.</li>\n</ul>\n</blockquote>\n<p>Given the influence of Transformers, this closer integration could lead to model releases that are compatible with the GGML ecosystem out of the box. That would be a big win for the local model ecosystem.</p>\n<p>I'm also excited to see investment in \"packaging and user experience of ggml-based software\". This has mostly been left to tools like <a href=\"https://ollama.com\">Ollama</a> and <a href=\"https://lmstudio.ai\">LM Studio</a>. ggml-org released <a href=\"https://github.com/ggml-org/LlamaBarn\">LlamaBarn</a> last year - \"a macOS menu bar app for running local LLMs\" - and I'm hopeful that further investment in this area will result in more high quality open source tools for running local models from the team best placed to deliver them.\n\n    <p><small></small>Via <a href=\"https://twitter.com/ggerganov/status/2024839991482777976\">@ggerganov</a></small></p>\n\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/open-source\">open-source</a>, <a href=\"https://simonwillison.net/tags/transformers\">transformers</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/llama\">llama</a>, <a href=\"https://simonwillison.net/tags/local-llms\">local-llms</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a>, <a href=\"https://simonwillison.net/tags/hugging-face\">hugging-face</a>, <a href=\"https://simonwillison.net/tags/llama-cpp\">llama-cpp</a></p>"
}