{
  "id": "76787b84bb882af9",
  "title": "Inside Microsoft’s Xbox Leadership Shake-Up",
  "url": "https://www.theverge.com/tech/883015/microsoft-xbox-new-ceo-shakeup-notepad?view_token=eyJhbGciOiJIUzI1NiJ9.eyJpZCI6InRTTTJnMGhOeHUiLCJwIjoiL3RlY2gvODgzMDE1L21pY3Jvc29mdC14Ym94LW5ldy1jZW8tc2hha2V1cC1ub3RlcGFkIiwiZXhwIjoxNzcyMzg1MDQ2LCJpYXQiOjE3NzE5NTMwNDZ9.e7qs5kHGt3-WwS9kfU9b59hS8SP6Z1OLePryV76Mzu4",
  "content": "<p>Tom Warren, reporting for The Verge (gift link):</p>\n\n<blockquote>\n  <p>With Spencer’s retirement official, Microsoft is hitting the reset\nbutton on Bond’s Xbox strategy instead of embracing it further.\nMicrosoft Gaming CEO Asha Sharma is now promising “the return of\nXbox,” in a clear message to employees that the strategy over the\npast few years has not been working. “I want to return to the\nrenegade spirit that built Xbox in the first place,” says Sharma.</p>\n\n<p>Xbox employees I’ve been speaking to have been concerned about the\nSharma appointment, particularly because of her previous role as\nan AI executive at Microsoft. There is also concern about her lack\nof industry experience in entertainment and gaming. Sharma has\nbeen clear she’s not a gamer and has spent the weekend responding\nto people on X and even taking game recommendations.</p>\n\n<p>Some Xbox employees worry she’ll force AI into everything Xbox\ndoes, but Sharma was clearly ready for that reaction. “As\nmonetization and AI evolve and influence this future, we will not\nchase short-term efficiency or flood our ecosystem with soulless\nAI slop,” said Sharma in her memo. “Games are and always will be\nart, crafted by humans, and created with the most innovative\ntechnology provided by us.”</p>\n</blockquote>\n\n<p>Spending two years <a href=\"https://www.theverge.com/2024/11/14/24296420/microsoft-this-is-an-xbox-marketing-campaign-xbox-everywhere\">on a marketing strategy that tried to turn “Xbox” into a vaporous brand</a> applied to any sort of gaming — mobile, handheld, PC, and, you know, Xbox consoles — on “every screen” is going to be a hard hole to climb out of. Xbox was behind PlayStation, their archrival, when they started this asinine campaign. Now they’re further behind. Sony’s message for PlayStation is clear and true: you buy a PlayStation to play PlayStation games.</p>\n\n<blockquote>\n  <p>The other concern is that she’s been appointed by Nadella as some\nkind of executioner of the Xbox console. Her memo doesn’t suggest\nthat, and Microsoft could have easily appointed Matt Booty into\nthat kind of role to push game publishing instead of the Xbox\nconsole. I get the impression from sources that Microsoft wants a\nturnaround and is worried about losing Xbox, as it’s one of its\nonly remaining successful consumer brands.</p>\n</blockquote>\n\n<p>I hope that’s true. But if Sharma <em>was</em> appointed by Nadella to wind Xbox down and get out of the business (after they package up and sell their $69 billion Activision acquisition to recoup), well, of course her introductory memo didn’t suggest that. Whether her actual mission is to rejuvenate the Xbox platform or to kill it, this week’s memo would read the same way. (Good discussion between me and Ben Thompson on <a href=\"https://dithering.fm/\">today’s Dithering</a> about this.)</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/02/24/inside-microsofts-xbox-leadership-shake-up\" title=\"Permanent link to ‘Inside Microsoft’s Xbox Leadership Shake-Up’\">&nbsp;★&nbsp;</a>\n</div>"
}