{
  "id": "7a57b8155389d1fa",
  "title": "Understanding the limitation of 'do in new frame/window' in GNU Emacs",
  "url": "https://utcc.utoronto.ca/~cks/space/blog/programming/EmacsNewWhateverLimitation",
  "content": "<div class=\"wikitext\"><p>GNU Emacs has a core model for how it operates, and some of its\nweird seeming limitations are easier to understand if you internalize\nthat model. One of them is what you have to do in GNU Emacs to get\nthe perfectly sensible operation of 'do &lt;X> in a new frame or\nwindow'. For instance, one of the things I periodically want to do\nin <a href=\"https://www.gnu.org/software/emacs/manual/html_mono/mh-e.html\">MH-E</a>\nis 'open a folder in a new frame', so that I can go through it while\nkeeping my main MH-E environment on my inbox to process incoming\nemail.</p>\n\n<p>If you dig through existing GNU Emacs ELisp functions, you won't\nfind a 'make-frame-do-operation' function, which is a bit frustrating.\nGNU Emacs has <a href=\"https://www.gnu.org/software/emacs/manual/html_node/emacs/Creating-Frames.html\">a whole collection of operations for making a new\nframe</a>,\nand I can run <code>mh-visit-folder</code> in the context of this frame, so\nit seems like there should be a simple function I could invoke to\ndo this and create my own 'C-x 5 v' binding for 'visit MH-E folder\nin other frame'.</p>\n\n<p>The clue to what's going on is in the description of C-x 5 5 from\nthe <a href=\"https://www.gnu.org/software/emacs/manual/html_node/emacs/Creating-Frames.html\">Creating Frames</a>\npage of the manual, with the emphasis mine:</p>\n\n<blockquote><p>A more general prefix command that affects the buffer displayed\nby a subsequent command invoked after this prefix command\n(<code>other-frame-prefix</code>). It requests <strong>the buffer to be displayed by a\nsubsequent command</strong> to be shown in another frame.</p>\n</blockquote>\n\n<p>GNU Emacs frames (and windows) don't run commands and show their\noutput, they display (GNU Emacs) buffers. In order to create a\nframe, you must have some buffer to display on that frame, and GNU\nEmacs must know what it is. GNU Emacs has some relatively complex\nand magical code to implement the 'C-x 5 5' and 'C-x 4 4' prefix\ncommands, but it's all still fundamentally starting from having\nsome buffer to display, not from running a command. The code basically\nassumes you're running a command that will at some point try to\ndisplay a buffer, and it hooks into that 'please display this buffer'\noperation to make the new frame or window and then display the\nbuffer in it.</p>\n\n<p>(Buffers can be created to show files, but they can also be created\nfor a lot of other purposes, including non-file buffers created by\nELisp commands that want to present text to you. All of <a href=\"https://www.gnu.org/software/emacs/manual/html_mono/mh-e.html\">MH-E</a>'s\nbuffers are non-file ones, as are things like <a href=\"https://magit.vc/\">Magit</a>'s\ninformation displays.)</p>\n\n<p>The corollary of this is that the most straightforward way to write\nour own ELisp code to run a command in a new frame is to start out\nby <a href=\"https://www.gnu.org/software/emacs/manual/html_node/elisp/Switching-Buffers.html#index-switch_002dto_002dbuffer_002dother_002dframe\">switching to some buffer in another frame</a>,\nsuch as '<code>*scratch*</code>', and then run our command. In an extremely\nminimal form, this looks like:</p>\n\n<blockquote><pre style=\"white-space: pre-wrap;\">\n(defun mh-visit-folder-other-frame (folder &amp;optional argp)\n  \"....\"\n  (interactive [...])\n  (switch-to-buffer-other-frame \"*scratch*\")\n  (mh-visit-folder folder argp))\n</pre>\n</blockquote>\n\n<p>If you know that your command displays a specific buffer, ideally\nyou'll check to see if that buffer exists already and switch to it\ninstead of to some scratch buffer that you're only using because\nyou need to tell Emacs to display some buffer (any buffer) in the\nnew frame.</p>\n\n<p>(In normal GNU Emacs environments you can be pretty confident that\nthere's a <code>*scratch*</code> buffer sitting around. GNU Emacs normally\ncreates it on startup and most people don't delete it. And if you're\nwriting your own code, you can definitely not delete it yourself.)</p>\n\n<p>Now that I've written this entry, maybe I'll remember 'C-x 5 5' and\nalso stop feeling vaguely irritated every time I do the equivalent\nby hand ('C-x 5 b', pick <code>*scratch*</code>, and then run my command in\nthe newly created frame).</p>\n\n<p>PS: It's probably possible to write a general ELisp function to run\nanother function and make any buffers it wants to show come up on\nanother frame, using the machinery that 'C-x 5 5' does. I will leave\nwriting this function as an exercise for my readers (although maybe\nit already exists somewhere).</p>\n</div>\n<div> (<a href=\"https://utcc.utoronto.ca/~cks/space/blog/programming/EmacsNewWhateverLimitation?showcomments#comments\">2 comments</a>.) </div>"
}