{
  "id": "9b09aafc5a6486b9",
  "title": "How Jeffrey Epstein Ingratiated Himself With Top Microsoft Executives",
  "url": "https://www.nytimes.com/2026/02/24/technology/jeffrey-epstein-microsoft-executives.html?unlocked_article_code=1.OlA.6mOw.2gNT6rp9X0SS",
  "content": "<p>Erin Griffith and Karen Weise, reporting for The New York Times (gift link):</p>\n\n<blockquote>\n  <p>More than he did at any other major tech company, Mr. Epstein\nfound success boring into the inner sanctums of Microsoft.\nLeveraging one connection into the next, he became privy to the\ncompany’s dramas, from its chief executive succession to the\nphilanthropy of top executives. After Mr. Epstein left prison in\n2009 for soliciting prostitution from a minor, his connections to\nMicrosoft executives aided his attempt to return to society. [...]</p>\n\n<p>[Nathan] Myhrvold, meanwhile, developed a relationship with Mr.\nEpstein that spanned two decades and led to more Microsoft\nconnections for the financier. The two were friendly enough that\nin 2003, Mr. Myhrvold, who had left Microsoft but was close to Mr.\nGates, contributed to Mr. Epstein’s 50th birthday book.</p>\n</blockquote>\n\n<p>That’s <a href=\"https://www.pbs.org/newshour/nation/see-epsteins-full-birthday-book-with-alleged-personal-messages-from-trump-clinton-and-others\">the same book</a> where <a href=\"https://www.wsj.com/us-news/law/trump-jeffrey-epstein-letter-birthday-book-analysis-0bbeeaf6?st=i3v3VX&amp;reflink=desktopwebshare_permalink\">Donald Trump’s contribution was a sketch of a naked woman</a> (with his signature serving as pubic hair) and a creepy poem.</p>\n\n<blockquote>\n  <p>“A few years ago somebody at a party asked me, ‘Does Jeffrey\nEpstein manage your money?’” Mr. Myhrvold wrote in the book. “I\nreplied, ‘No, but he advises me on lifestyle.’”</p>\n\n<p>Mr. Myhrvold included images that he had taken on a trip to Africa\nand that he said “seemed more appropriate than anything I could\nput in words,” including photos of lions and zebras mating, and\nother wildlife in states of arousal.</p>\n</blockquote>\n\n<p>Nathan Myhrvold always struck me as a weird man. But what a fucking creep.</p>\n\n<blockquote>\n  <p>Significantly, Mr. Myhrvold vouched for Mr. Epstein to Mr. Gates,\nwho was debating meeting the financier for the first time,\naccording to the documents. By December 2010, Mr. Gates had\ndecided to meet Mr. Epstein and <a href=\"https://www.justice.gov/epstein/files/DataSet%2011/EFTA02410629.pdf\">wrote</a> to two employees of\nhis private office that “Nathan had agreed with you that I would\nenjoy meeting with him and that it is a fine thing to do.”</p>\n</blockquote>\n\n<p>Yeah, maybe not such a fine thing to do.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/02/24/epstein-microsoft\" title=\"Permanent link to ‘How Jeffrey Epstein Ingratiated Himself With Top Microsoft Executives’\">&nbsp;★&nbsp;</a>\n</div>"
}