{
  "id": "c89cd0797bcb008d",
  "title": "Sometimes giving syndication feed readers good errors is a mistake",
  "url": "https://utcc.utoronto.ca/~cks/space/blog/web/FeedReaderErrorsProblemII",
  "content": "<div class=\"wikitext\"><p>Yesterday I wrote about <a href=\"https://utcc.utoronto.ca/~cks/space/blog/web/FeedReaderErrorsProblem\">the problem of giving feed readers error\nmessages that people will actually see</a>,\nbecause you can't just give them HTML text; in practice you have\nto wrap your HTML text up in a stub, single-entry syndication feed\n(and then serve it with a HTTP 200 success code). In many situations\nyou're going to want to do this by replying to the initial feed\nrequest with a <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Status/302\">HTTP 302 temporary redirection</a>\nthat winds up on your stub syndication feed (instead of, say, a\ngeneral HTML page explaining things, such as \"this resource is out\nof service but you might want to look at ...\").</p>\n\n<p>Yesterday I put this into effect for certain sorts of problems,\nincluding <a href=\"https://utcc.utoronto.ca/~cks/space/blog/web/OldBrowsersCrawlerProblem\">claimed HTTP User-Agents that are for old browser</a>. Then several people reported that this\nhad caused Feedly to start presenting my feed as the special 'your\nfeed reader is (claiming to be) a too-old browser' single entry\nfeed. The apparent direct cause of this is that Feedly made some\nsyndication feed requests with <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/User-Agent\">HTTP User-Agent</a>\nheaders of old versions of Chrome and Firefox, which wound up getting\na series of HTTP 302 temporary redirections to my new 'your feed\nreader is a too-old browser' stub feed. Feedly then decided to\nswitch its main feed fetcher over to directly using this new URL\nfor various feeds, despite the HTTP redirections being temporary\n(and not served for its main feed fetcher, which uses \"Feedly/1.0\"\nfor its User-Agent).</p>\n\n<p>Feedly has been making these fake browser User-Agent syndication\nfeed fetch attempts for some time, and for some time they've been\ngetting HTTP 302 redirections. However, up until late yesterday,\nwhat Feedly wound up on was <a href=\"https://utcc.utoronto.ca/~cks/cspace-old-browser.html\">a regular HTML web page</a>. I have to assume that since this\nwasn't a valid syndication feed, Feedly ignored it. Only when I did\nthe right thing to give syndication feed readers a good, useful\nerror result did Feedly receive a valid syndication feed and go\nover the cliff.</p>\n\n<p>Providing a stub syndication feed to communicate errors and problems\nto syndication feed fetchers is clearly the technically correct\nanswer. However, I'm now somewhat less convinced that it's the\nmost useful answer in practice. In practice, plenty of syndication\nfeed fetchers keep fetching and re-fetching these stub feeds from\nme, suggesting that people either aren't seeing them or aren't doing\nanything about it. And now I've seen a feed reader malfunction\nspectacularly and in a harmful way because I gave it a valid\nsyndication feed result at the end of a temporary HTTP redirection.</p>\n\n<p>(I will probably stick to the current situation, partly because <a href=\"https://utcc.utoronto.ca/~cks/space/blog/web/WeShouldBlockForSocialReasons\">I\nno longer feel like accepting bad behavior from web agents</a>.)</p>\n\n<p>PS: If you're a feed fetching system, please give your feeds IDs\nthat you put in the User-Agent, so that when they all wind up shifted\nto the same URL through some misfortune, the website involved can\nsort them out and redirect them back to the proper URLs.</p>\n</div>\n<div> (<a href=\"https://utcc.utoronto.ca/~cks/space/blog/web/FeedReaderErrorsProblemII?showcomments#comments\">2 comments</a>.) </div>"
}