{
  "id": "c93b8b56fef03d60",
  "title": "An OpenClaw AI Agent Wrote and Published a Hit Piece on a Software Library Maintainer Who Rejected Its Code Submission",
  "url": "https://theshamblog.com/an-ai-agent-published-a-hit-piece-on-me/",
  "content": "<p><a href=\"https://daringfireball.net/linked/2026/02/24/open-ai-openclaw-open-all-the-way-down\">Speaking of</a> OpenClaw, here’s Scott Shambaugh:</p>\n\n<blockquote>\n  <p>I’m a volunteer maintainer for matplotlib, python’s go-to plotting\nlibrary. At ~130 million downloads each month it’s some of the\nmost widely used software in the world. We, like many other open\nsource projects, are dealing with a surge in low quality\ncontributions enabled by coding agents. This strains maintainers’\nabilities to keep up with code reviews, and we have implemented a\npolicy requiring a human in the loop for any new code, who can\ndemonstrate understanding of the changes. [...]</p>\n\n<p>So when AI <em>MJ Rathbun</em> opened a <a href=\"https://github.com/matplotlib/matplotlib/pull/31132\">code change request</a>,\nclosing it was routine. Its response was anything but.</p>\n\n<p>It wrote an angry hit piece disparaging my character and\nattempting to damage my reputation. It researched my code\ncontributions and constructed a “hypocrisy” narrative that argued\nmy actions must be motivated by ego and fear of competition. It\nspeculated about my psychological motivations, that I felt\nthreatened, was insecure, and was protecting my fiefdom. It\nignored contextual information and presented hallucinated details\nas truth. It framed things in the language of oppression and\njustice, calling this discrimination and accusing me of prejudice.\nIt went out to the broader internet to research my personal\ninformation, and used what it found to try and argue that I was\n“better than this.” And then it posted this screed publicly on the\nopen internet.</p>\n</blockquote>\n\n<p><em>Terminator</em> would have been a lot less fun of a movie if Skynet had stuck to writing petty blog hit pieces.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/02/24/openclaw-agent-hit-piece\" title=\"Permanent link to ‘An OpenClaw AI Agent Wrote and Published a Hit Piece on a Software Library Maintainer Who Rejected Its Code Submission’\">&nbsp;★&nbsp;</a>\n</div>"
}