{
  "id": "d29819d54625b1ef",
  "title": "Gwtar: a static efficient single-file HTML format",
  "url": "https://simonwillison.net/2026/Feb/15/gwtar/#atom-everything",
  "content": "<p><strong><a href=\"https://gwern.net/gwtar\">Gwtar: a static efficient single-file HTML format</a></strong></p>\nFascinating new project from Gwern Branwen and Said Achmiz that targets the challenge of combining large numbers of assets into a single archived HTML file without that file being inconvenient to view in a browser.</p>\n<p>The key trick it uses is to fire <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Window/stop\">window.stop()</a> early in the page to prevent the browser from downloading the whole thing, then following that call with inline tar uncompressed content.</p>\n<p>It can then make HTTP range requests to fetch content from that tar data on-demand when it is needed by the page.</p>\n<p>The JavaScript that has already loaded rewrites asset URLs to point to <code>https://localhost/</code> purely so that they will fail to load. Then it uses a <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/PerformanceObserver\">PerformanceObserver</a> to catch those attempted loads:</p>\n<pre><code>let perfObserver = new PerformanceObserver((entryList, observer) =&gt; {\n    resourceURLStringsHandler(entryList.getEntries().map(entry =&gt; entry.name));\n});\nperfObserver.observe({ entryTypes: [ \"resource\" ] });\n</code></pre>\n<p>That <code>resourceURLStringsHandler</code> callback finds the resource if it is already loaded or fetches it with an HTTP range request otherwise and then inserts the resource in the right place using a <code>blob:</code> URL.</p>\n<p>Here's what the <code>window.stop()</code> portion of the document looks like if you view the source:</p>\n<p><img alt=\"Screenshot of a macOS terminal window titled &quot;gw — more big.html — 123×46&quot; showing the source code of a gwtar (self-extracting HTML archive) file. The visible code includes JavaScript with requestIdleCallback(getMainPageHTML);, a &lt;noscript&gt; block with warnings: a &quot;js-disabled-warning&quot; stating &quot;This HTML page requires JavaScript to be enabled to render, as it is a self-extracting gwtar HTML file,&quot; a description of gwtar as &quot;a portable self-contained standalone HTML file which is designed to nevertheless support efficient lazy loading of all assets such as large media files,&quot; with a link to https://gwern.net/gwtar, a &quot;local-file-warning&quot; with a shell command perl -ne'print $_ if $x; $x=1 if /&lt;!-- GWTAR END/' &amp;lt; foo.gwtar.html | tar --extract, and a &quot;server-fail-warning&quot; about misconfigured servers. Below the HTML closing tags and &lt;!-- GWTAR END comment is binary tar archive data with the filename 2010-02-brianmoriarty-thesecretofpsalm46.html, showing null-padded tar header fields including ustar^@00root and octal size/permission values. At the bottom, a SingleFile metadata comment shows url: https://web.archive.org/web/20230512001411/http://ludix.com/moriarty/psalm46.html and saved date: Sat Jan 17 2026 19:26:49 GMT-0800 (Pacific Standard Time).\" src=\"https://static.simonwillison.net/static/2026/gwtar.jpg\" /></p>\n<p>Amusingly for an archive format it doesn't actually work if you open the file directly on your own computer. Here's what you see if you try to do that:</p>\n<blockquote>\n<p>You are seeing this message, instead of the page you should be seeing, because <code>gwtar</code> files <strong>cannot be opened locally</strong> (due to web browser security restrictions).</p>\n<p>To open this page on your computer, use the following shell command:</p>\n<p><code>perl -ne'print $_ if $x; $x=1 if /&lt;!-- GWTAR END/' &lt; foo.gwtar.html | tar --extract</code></p>\n<p>Then open the file <code>foo.html</code> in any web browser.</p>\n</blockquote>\n\n    <p><small></small>Via <a href=\"https://news.ycombinator.com/item?id=47024506\">Hacker News</a></small></p>\n\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/archiving\">archiving</a>, <a href=\"https://simonwillison.net/tags/html\">html</a>, <a href=\"https://simonwillison.net/tags/javascript\">javascript</a></p>"
}