{
  "id": "f838169ae71a55a9",
  "title": "Nano Banana Pro diff to webcomic",
  "url": "https://simonwillison.net/2026/Feb/17/release-notes-webcomic/#atom-everything",
  "content": "<p>Given the threat of <a href=\"https://simonwillison.net/tags/cognitive-debt/\">cognitive debt</a> brought on by AI-accelerated software development leading to more projects and less deep understanding of how they work and what they actually do, it's interesting to consider artifacts that might be able to help.</p>\n<p>Nathan Baschez <a href=\"https://twitter.com/nbaschez/status/2023501535343509871\">on Twitter</a>:</p>\n<blockquote>\n<p>my current favorite trick for reducing \"cognitive debt\" (h/t @simonw\n) is to ask the LLM to write two versions of the plan:</p>\n<ol>\n<li>The version for it (highly technical and detailed)</li>\n<li>The version for me (an entertaining essay designed to build my intuition)</li>\n</ol>\n<p>Works great</p>\n</blockquote>\n<p>This inspired me to try something new. I generated <a href=\"https://github.com/simonw/showboat/compare/v0.5.0...v0.6.0.diff\">the diff</a> between v0.5.0 and v0.6.0 of my Showboat project - which introduced <a href=\"https://simonwillison.net/2026/Feb/17/chartroom-and-datasette-showboat/#showboat-remote-publishing\">the remote publishing feature</a> - and dumped that into Nano Banana Pro with the prompt:</p>\n<blockquote>\n<p>Create a webcomic that explains the new feature as clearly and entertainingly as possible</p>\n</blockquote>\n<p>Here's <a href=\"https://gemini.google.com/share/cce6da8e5083\">what it produced</a>:</p>\n<p><img alt=\"A six-panel comic strip illustrating a tool called &quot;Showboat&quot; for live-streaming document building. Panel 1, titled &quot;THE OLD WAY: Building docs was a lonely voyage. You finished it all before anyone saw it.&quot;, shows a sad bearded man on a wooden boat labeled &quot;THE LOCALHOST&quot; holding papers and saying &quot;Almost done... then I have to export and email the HTML...&quot;. Panel 2, titled &quot;THE UPGRADE: Just set the environment variable!&quot;, shows the same man excitedly plugging in a device with a speech bubble reading &quot;ENV VAR: SHOWBOAT_REMOTE_URL&quot; and the sound effect &quot;*KA-CHUNK!*&quot;. Panel 3, titled &quot;init establishes the uplink and generates a unique UUID beacon.&quot;, shows the man typing at a keyboard with a terminal reading &quot;$ showboat init 'Live Demo'&quot;, a satellite dish transmitting to a floating label &quot;UUID: 550e84...&quot;, and a monitor reading &quot;WAITING FOR STREAM...&quot;. Panel 4, titled &quot;Every note and exec is instantly beamed to the remote viewer!&quot;, shows the man coding with sound effects &quot;*HAMMER!*&quot;, &quot;ZAP!&quot;, &quot;ZAP!&quot;, &quot;BANG!&quot; as red laser beams shoot from a satellite dish to a remote screen displaying &quot;NOTE: Step 1...&quot; and &quot;SUCCESS&quot;. Panel 5, titled &quot;Even image files are teleported in real-time!&quot;, shows a satellite dish firing a cyan beam with the sound effect &quot;*FOOMP!*&quot; toward a monitor displaying a bar chart. Panel 6, titled &quot;You just build. The audience gets the show live.&quot;, shows the man happily working at his boat while a crowd of cheering people watches a projected screen reading &quot;SHOWBOAT LIVE STREAM: Live Demo&quot;, with a label &quot;UUID: 550e84...&quot; and one person in the foreground eating popcorn.\" src=\"https://static.simonwillison.net/static/2026/nano-banana-diff.jpg\" /></p>\n<p>Good enough to publish with the release notes? I don't think so. I'm sharing it here purely to demonstrate the idea. Creating assets like this as a personal tool for thinking about novel ways to explain a feature feels worth exploring further.</p>\n\n    <p>Tags: <a href=\"https://simonwillison.net/tags/nano-banana\">nano-banana</a>, <a href=\"https://simonwillison.net/tags/gemini\">gemini</a>, <a href=\"https://simonwillison.net/tags/llms\">llms</a>, <a href=\"https://simonwillison.net/tags/cognitive-debt\">cognitive-debt</a>, <a href=\"https://simonwillison.net/tags/generative-ai\">generative-ai</a>, <a href=\"https://simonwillison.net/tags/ai\">ai</a>, <a href=\"https://simonwillison.net/tags/text-to-image\">text-to-image</a>, <a href=\"https://simonwillison.net/tags/showboat\">showboat</a>, <a href=\"https://simonwillison.net/tags/ai-assisted-programming\">ai-assisted-programming</a></p>"
}